Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 112, 112, 3) 0                                            
__________________________________________________________________________________________________
img_augmentation (Sequential)   (None, 112, 112, 3)  0           input_1[0][0]                    
__________________________________________________________________________________________________
rescaling (Rescaling)           (None, 112, 112, 3)  0           img_augmentation[0][0]           
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 56, 56, 32)   896         rescaling[0][0]                  
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 56, 56, 32)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 56, 56, 32)   0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 56, 56, 64)   18496       activation[0][0]                 
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 56, 56, 64)   256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 56, 56, 64)   0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 56, 56, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
separable_conv2d (SeparableConv (None, 56, 56, 128)  8896        activation_2[0][0]               
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 56, 56, 128)  512         separable_conv2d[0][0]           
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 56, 56, 128)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
separable_conv2d_1 (SeparableCo (None, 56, 56, 128)  17664       activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 56, 56, 128)  512         separable_conv2d_1[0][0]         
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 28, 28, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 28, 28, 128)  8320        activation_1[0][0]               
__________________________________________________________________________________________________
add (Add)                       (None, 28, 28, 128)  0           max_pooling2d[0][0]              
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 28, 28, 128)  0           add[0][0]                        
__________________________________________________________________________________________________
separable_conv2d_2 (SeparableCo (None, 28, 28, 256)  34176       activation_4[0][0]               
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 28, 28, 256)  1024        separable_conv2d_2[0][0]         
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 28, 28, 256)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
separable_conv2d_3 (SeparableCo (None, 28, 28, 256)  68096       activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 28, 28, 256)  1024        separable_conv2d_3[0][0]         
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 14, 14, 256)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 14, 14, 256)  33024       add[0][0]                        
__________________________________________________________________________________________________
add_1 (Add)                     (None, 14, 14, 256)  0           max_pooling2d_1[0][0]            
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 14, 14, 256)  0           add_1[0][0]                      
__________________________________________________________________________________________________
separable_conv2d_4 (SeparableCo (None, 14, 14, 512)  133888      activation_6[0][0]               
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 14, 14, 512)  2048        separable_conv2d_4[0][0]         
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 14, 14, 512)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
separable_conv2d_5 (SeparableCo (None, 14, 14, 512)  267264      activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 14, 14, 512)  2048        separable_conv2d_5[0][0]         
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 7, 7, 512)    0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 512)    131584      add_1[0][0]                      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 7, 7, 512)    0           max_pooling2d_2[0][0]            
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 7, 7, 512)    0           add_2[0][0]                      
__________________________________________________________________________________________________
separable_conv2d_6 (SeparableCo (None, 7, 7, 728)    378072      activation_8[0][0]               
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 7, 7, 728)    2912        separable_conv2d_6[0][0]         
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 7, 7, 728)    0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
separable_conv2d_7 (SeparableCo (None, 7, 7, 728)    537264      activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 7, 7, 728)    2912        separable_conv2d_7[0][0]         
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 4, 4, 728)    0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 4, 4, 728)    373464      add_2[0][0]                      
__________________________________________________________________________________________________
add_3 (Add)                     (None, 4, 4, 728)    0           max_pooling2d_3[0][0]            
                                                                 conv2d_5[0][0]                   
__________________________________________________________________________________________________
separable_conv2d_8 (SeparableCo (None, 4, 4, 1024)   753048      add_3[0][0]                      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 4, 4, 1024)   4096        separable_conv2d_8[0][0]         
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 4, 4, 1024)   0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d (Globa (None, 1024)         0           activation_10[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 1024)         0           global_average_pooling2d[0][0]   
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            1025        dropout[0][0]                    
==================================================================================================
Total params: 2,782,649
Trainable params: 2,773,913
Non-trainable params: 8,736
__________________________________________________________________________________________________